using Microsoft.EntityFrameworkCore.Migrations;

#nullable disable

#pragma warning disable CA1814 // Prefer jagged arrays over multidimensional

namespace BazaR.Migrations
{
    /// <inheritdoc />
    public partial class FiltersForCategories : Migration
    {
        /// <inheritdoc />
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.InsertData(
                table: "CategoryFilters",
                columns: new[] { "Id", "CategoryId", "DisplayName", "ItemId", "Key", "ValueType" },
                values: new object[,]
                {
                    { -2596, 1903, "Категорія товару", null, "category", 0 },
                    { -2595, 1903, "Розмір знижки", null, "discount_size", 1 },
                    { -2594, 1902, "Категорія товару", null, "category", 0 },
                    { -2593, 1902, "Розмір знижки", null, "discount_size", 1 },
                    { -2592, 1901, "Категорія товару", null, "category", 0 },
                    { -2591, 1901, "Розмір знижки", null, "discount_size", 1 },
                    { -2590, 1802, "Категорія товару", null, "category", 0 },
                    { -2589, 1802, "Розмір знижки", null, "discount_size", 1 },
                    { -2588, 1801, "Категорія товару", null, "category", 0 },
                    { -2587, 1801, "Розмір знижки", null, "discount_size", 1 },
                    { -2586, 1706, "Місткість", null, "capacity", 1 },
                    { -2585, 1706, "Тип", null, "type", 0 },
                    { -2584, 1705, "Місткість", null, "capacity", 1 },
                    { -2583, 1705, "Тип", null, "type", 0 },
                    { -2582, 1704, "Місткість", null, "capacity", 1 },
                    { -2581, 1704, "Тип", null, "type", 0 },
                    { -2580, 1703, "Місткість", null, "capacity", 1 },
                    { -2579, 1703, "Тип", null, "type", 0 },
                    { -2578, 1702, "Місткість", null, "capacity", 1 },
                    { -2577, 1702, "Тип", null, "type", 0 },
                    { -2576, 1701, "Місткість", null, "capacity", 1 },
                    { -2575, 1701, "Тип", null, "type", 0 },
                    { -2574, 1606, "Тип обладнання", null, "equipment_type", 0 },
                    { -2573, 1605, "Тип обладнання", null, "equipment_type", 0 },
                    { -2572, 1604, "Тип обладнання", null, "equipment_type", 0 },
                    { -2571, 1603, "Тип обладнання", null, "equipment_type", 0 },
                    { -2570, 1602, "Тип обладнання", null, "equipment_type", 0 },
                    { -2569, 1601, "Тип обладнання", null, "equipment_type", 0 },
                    { -2568, 1507, "Міцність", null, "strength", 1 },
                    { -2567, 1507, "Об'єм", null, "volume", 1 },
                    { -2566, 1507, "Тип", null, "type", 0 },
                    { -2565, 1506, "Міцність", null, "strength", 1 },
                    { -2564, 1506, "Об'єм", null, "volume", 1 },
                    { -2563, 1506, "Тип", null, "type", 0 },
                    { -2562, 1505, "Міцність", null, "strength", 1 },
                    { -2561, 1505, "Об'єм", null, "volume", 1 },
                    { -2560, 1505, "Тип", null, "type", 0 },
                    { -2559, 1504, "Міцність", null, "strength", 1 },
                    { -2558, 1504, "Об'єм", null, "volume", 1 },
                    { -2557, 1504, "Тип", null, "type", 0 },
                    { -2556, 1503, "Міцність", null, "strength", 1 },
                    { -2555, 1503, "Об'єм", null, "volume", 1 },
                    { -2554, 1503, "Тип", null, "type", 0 },
                    { -2553, 1502, "Міцність", null, "strength", 1 },
                    { -2552, 1502, "Об'єм", null, "volume", 1 },
                    { -2551, 1502, "Тип", null, "type", 0 },
                    { -2550, 1501, "Міцність", null, "strength", 1 },
                    { -2549, 1501, "Об'єм", null, "volume", 1 },
                    { -2548, 1501, "Тип", null, "type", 0 },
                    { -2547, 1407, "Формат", null, "format", 0 },
                    { -2546, 1407, "Тип", null, "type", 0 },
                    { -2545, 1406, "Формат", null, "format", 0 },
                    { -2544, 1406, "Тип", null, "type", 0 },
                    { -2543, 1405, "Формат", null, "format", 0 },
                    { -2542, 1405, "Тип", null, "type", 0 },
                    { -2541, 1404, "Формат", null, "format", 0 },
                    { -2540, 1404, "Тип", null, "type", 0 },
                    { -2539, 1403, "Формат", null, "format", 0 },
                    { -2538, 1403, "Тип", null, "type", 0 },
                    { -2537, 1402, "Формат", null, "format", 0 },
                    { -2536, 1402, "Тип", null, "type", 0 },
                    { -2535, 1401, "Формат", null, "format", 0 },
                    { -2534, 1401, "Тип", null, "type", 0 },
                    { -2533, 1309, "Вік тварини", null, "animal_age", 0 },
                    { -2532, 1309, "Вид товару", null, "product_type", 0 },
                    { -2531, 1309, "Тип тварини", null, "animal_type", 0 },
                    { -2530, 1308, "Вік тварини", null, "animal_age", 0 },
                    { -2529, 1308, "Вид товару", null, "product_type", 0 },
                    { -2528, 1308, "Тип тварини", null, "animal_type", 0 },
                    { -2527, 1307, "Вік тварини", null, "animal_age", 0 },
                    { -2526, 1307, "Вид товару", null, "product_type", 0 },
                    { -2525, 1307, "Тип тварини", null, "animal_type", 0 },
                    { -2524, 1306, "Вік тварини", null, "animal_age", 0 },
                    { -2523, 1306, "Вид товару", null, "product_type", 0 },
                    { -2522, 1306, "Тип тварини", null, "animal_type", 0 },
                    { -2521, 1305, "Вік тварини", null, "animal_age", 0 },
                    { -2520, 1305, "Вид товару", null, "product_type", 0 },
                    { -2519, 1305, "Тип тварини", null, "animal_type", 0 },
                    { -2518, 1304, "Вік тварини", null, "animal_age", 0 },
                    { -2517, 1304, "Вид товару", null, "product_type", 0 },
                    { -2516, 1304, "Тип тварини", null, "animal_type", 0 },
                    { -2515, 1303, "Вік тварини", null, "animal_age", 0 },
                    { -2514, 1303, "Вид товару", null, "product_type", 0 },
                    { -2513, 1303, "Тип тварини", null, "animal_type", 0 },
                    { -2512, 1302, "Вік тварини", null, "animal_age", 0 },
                    { -2511, 1302, "Вид товару", null, "product_type", 0 },
                    { -2510, 1302, "Тип тварини", null, "animal_type", 0 },
                    { -2509, 1301, "Вік тварини", null, "animal_age", 0 },
                    { -2508, 1301, "Вид товару", null, "product_type", 0 },
                    { -2507, 1301, "Тип тварини", null, "animal_type", 0 },
                    { -2506, 1210, "Тип", null, "type", 0 },
                    { -2505, 1210, "Вік", null, "age", 1 },
                    { -2504, 1209, "Тип", null, "type", 0 },
                    { -2503, 1209, "Вік", null, "age", 1 },
                    { -2502, 1208, "Тип", null, "type", 0 },
                    { -2501, 1208, "Вік", null, "age", 1 },
                    { -2500, 1207, "Тип", null, "type", 0 },
                    { -2499, 1207, "Вік", null, "age", 1 },
                    { -2498, 1206, "Тип", null, "type", 0 },
                    { -2497, 1206, "Вік", null, "age", 1 },
                    { -2496, 1205, "Тип", null, "type", 0 },
                    { -2495, 1205, "Вік", null, "age", 1 },
                    { -2494, 1204, "Тип", null, "type", 0 },
                    { -2493, 1204, "Вік", null, "age", 1 },
                    { -2492, 1203, "Тип", null, "type", 0 },
                    { -2491, 1203, "Вік", null, "age", 1 },
                    { -2490, 1202, "Тип", null, "type", 0 },
                    { -2489, 1202, "Вік", null, "age", 1 },
                    { -2488, 1201, "Тип", null, "type", 0 },
                    { -2487, 1201, "Вік", null, "age", 1 },
                    { -2486, 1109, "Для кого", null, "for_whom", 0 },
                    { -2485, 1109, "Тип", null, "type", 0 },
                    { -2484, 1108, "Для кого", null, "for_whom", 0 },
                    { -2483, 1108, "Тип", null, "type", 0 },
                    { -2482, 1107, "Для кого", null, "for_whom", 0 },
                    { -2481, 1107, "Тип", null, "type", 0 },
                    { -2480, 1106, "Для кого", null, "for_whom", 0 },
                    { -2479, 1106, "Тип", null, "type", 0 },
                    { -2478, 1105, "Для кого", null, "for_whom", 0 },
                    { -2477, 1105, "Тип", null, "type", 0 },
                    { -2476, 1104, "Для кого", null, "for_whom", 0 },
                    { -2475, 1104, "Тип", null, "type", 0 },
                    { -2474, 1103, "Для кого", null, "for_whom", 0 },
                    { -2473, 1103, "Тип", null, "type", 0 },
                    { -2472, 1102, "Для кого", null, "for_whom", 0 },
                    { -2471, 1102, "Тип", null, "type", 0 },
                    { -2470, 1101, "Для кого", null, "for_whom", 0 },
                    { -2469, 1101, "Тип", null, "type", 0 },
                    { -2468, 1013, "Стать", null, "gender", 0 },
                    { -2467, 1013, "Матеріал", null, "material", 0 },
                    { -2466, 1013, "Колір", null, "color", 0 },
                    { -2465, 1013, "Розмір", null, "size", 0 },
                    { -2464, 1012, "Стать", null, "gender", 0 },
                    { -2463, 1012, "Матеріал", null, "material", 0 },
                    { -2462, 1012, "Колір", null, "color", 0 },
                    { -2461, 1012, "Розмір", null, "size", 0 },
                    { -2460, 1011, "Стать", null, "gender", 0 },
                    { -2459, 1011, "Матеріал", null, "material", 0 },
                    { -2458, 1011, "Колір", null, "color", 0 },
                    { -2457, 1011, "Розмір", null, "size", 0 },
                    { -2456, 1010, "Стать", null, "gender", 0 },
                    { -2455, 1010, "Матеріал", null, "material", 0 },
                    { -2454, 1010, "Колір", null, "color", 0 },
                    { -2453, 1010, "Розмір", null, "size", 0 },
                    { -2452, 1009, "Стать", null, "gender", 0 },
                    { -2451, 1009, "Матеріал", null, "material", 0 },
                    { -2450, 1009, "Колір", null, "color", 0 },
                    { -2449, 1009, "Розмір", null, "size", 0 },
                    { -2448, 1008, "Стать", null, "gender", 0 },
                    { -2447, 1008, "Матеріал", null, "material", 0 },
                    { -2446, 1008, "Колір", null, "color", 0 },
                    { -2445, 1008, "Розмір", null, "size", 0 },
                    { -2444, 1007, "Стать", null, "gender", 0 },
                    { -2443, 1007, "Матеріал", null, "material", 0 },
                    { -2442, 1007, "Колір", null, "color", 0 },
                    { -2441, 1007, "Розмір", null, "size", 0 },
                    { -2440, 1006, "Стать", null, "gender", 0 },
                    { -2439, 1006, "Матеріал", null, "material", 0 },
                    { -2438, 1006, "Колір", null, "color", 0 },
                    { -2437, 1006, "Розмір", null, "size", 0 },
                    { -2436, 1005, "Стать", null, "gender", 0 },
                    { -2435, 1005, "Матеріал", null, "material", 0 },
                    { -2434, 1005, "Колір", null, "color", 0 },
                    { -2433, 1005, "Розмір", null, "size", 0 },
                    { -2432, 1004, "Стать", null, "gender", 0 },
                    { -2431, 1004, "Матеріал", null, "material", 0 },
                    { -2430, 1004, "Колір", null, "color", 0 },
                    { -2429, 1004, "Розмір", null, "size", 0 },
                    { -2428, 1003, "Стать", null, "gender", 0 },
                    { -2427, 1003, "Матеріал", null, "material", 0 },
                    { -2426, 1003, "Колір", null, "color", 0 },
                    { -2425, 1003, "Розмір", null, "size", 0 },
                    { -2424, 1002, "Стать", null, "gender", 0 },
                    { -2423, 1002, "Матеріал", null, "material", 0 },
                    { -2422, 1002, "Колір", null, "color", 0 },
                    { -2421, 1002, "Розмір", null, "size", 0 },
                    { -2420, 1001, "Стать", null, "gender", 0 },
                    { -2419, 1001, "Матеріал", null, "material", 0 },
                    { -2418, 1001, "Колір", null, "color", 0 },
                    { -2417, 1001, "Розмір", null, "size", 0 },
                    { -2416, 909, "Розмір", null, "size", 0 },
                    { -2415, 909, "Вид спорту", null, "sport_type", 0 },
                    { -2414, 908, "Розмір", null, "size", 0 },
                    { -2413, 908, "Вид спорту", null, "sport_type", 0 },
                    { -2412, 907, "Розмір", null, "size", 0 },
                    { -2411, 907, "Вид спорту", null, "sport_type", 0 },
                    { -2410, 906, "Розмір", null, "size", 0 },
                    { -2409, 906, "Вид спорту", null, "sport_type", 0 },
                    { -2408, 905, "Розмір", null, "size", 0 },
                    { -2407, 905, "Вид спорту", null, "sport_type", 0 },
                    { -2406, 904, "Розмір", null, "size", 0 },
                    { -2405, 904, "Вид спорту", null, "sport_type", 0 },
                    { -2404, 903, "Розмір", null, "size", 0 },
                    { -2403, 903, "Вид спорту", null, "sport_type", 0 },
                    { -2402, 902, "Розмір", null, "size", 0 },
                    { -2401, 902, "Вид спорту", null, "sport_type", 0 },
                    { -2400, 901, "Розмір", null, "size", 0 },
                    { -2399, 901, "Вид спорту", null, "sport_type", 0 },
                    { -2398, 809, "Матеріал", null, "material", 0 },
                    { -2397, 809, "Тип", null, "type", 0 },
                    { -2396, 808, "Матеріал", null, "material", 0 },
                    { -2395, 808, "Тип", null, "type", 0 },
                    { -2394, 807, "Матеріал", null, "material", 0 },
                    { -2393, 807, "Тип", null, "type", 0 },
                    { -2392, 806, "Матеріал", null, "material", 0 },
                    { -2391, 806, "Тип", null, "type", 0 },
                    { -2390, 805, "Матеріал", null, "material", 0 },
                    { -2389, 805, "Тип", null, "type", 0 },
                    { -2388, 804, "Матеріал", null, "material", 0 },
                    { -2387, 804, "Тип", null, "type", 0 },
                    { -2386, 803, "Матеріал", null, "material", 0 },
                    { -2385, 803, "Тип", null, "type", 0 },
                    { -2384, 802, "Матеріал", null, "material", 0 },
                    { -2383, 802, "Тип", null, "type", 0 },
                    { -2382, 801, "Матеріал", null, "material", 0 },
                    { -2381, 801, "Тип", null, "type", 0 },
                    { -2380, 711, "Розмір", null, "size", 0 },
                    { -2379, 711, "Матеріал", null, "material", 0 },
                    { -2378, 710, "Розмір", null, "size", 0 },
                    { -2377, 710, "Матеріал", null, "material", 0 },
                    { -2376, 709, "Розмір", null, "size", 0 },
                    { -2375, 709, "Матеріал", null, "material", 0 },
                    { -2374, 708, "Розмір", null, "size", 0 },
                    { -2373, 708, "Матеріал", null, "material", 0 },
                    { -2372, 707, "Розмір", null, "size", 0 },
                    { -2371, 707, "Матеріал", null, "material", 0 },
                    { -2370, 706, "Розмір", null, "size", 0 },
                    { -2369, 706, "Матеріал", null, "material", 0 },
                    { -2368, 705, "Розмір", null, "size", 0 },
                    { -2367, 705, "Матеріал", null, "material", 0 },
                    { -2366, 704, "Розмір", null, "size", 0 },
                    { -2365, 704, "Матеріал", null, "material", 0 },
                    { -2364, 703, "Розмір", null, "size", 0 },
                    { -2363, 703, "Матеріал", null, "material", 0 },
                    { -2362, 702, "Розмір", null, "size", 0 },
                    { -2361, 702, "Матеріал", null, "material", 0 },
                    { -2360, 701, "Розмір", null, "size", 0 },
                    { -2359, 701, "Матеріал", null, "material", 0 },
                    { -2358, 610, "Тип інструменту", null, "type", 0 },
                    { -2357, 610, "Потужність", null, "power", 1 },
                    { -2356, 609, "Тип інструменту", null, "type", 0 },
                    { -2355, 609, "Потужність", null, "power", 1 },
                    { -2354, 608, "Тип інструменту", null, "type", 0 },
                    { -2353, 608, "Потужність", null, "power", 1 },
                    { -2352, 607, "Тип інструменту", null, "type", 0 },
                    { -2351, 607, "Потужність", null, "power", 1 },
                    { -2350, 606, "Тип інструменту", null, "type", 0 },
                    { -2349, 606, "Потужність", null, "power", 1 },
                    { -2348, 605, "Тип інструменту", null, "type", 0 },
                    { -2347, 605, "Потужність", null, "power", 1 },
                    { -2346, 604, "Тип інструменту", null, "type", 0 },
                    { -2345, 604, "Потужність", null, "power", 1 },
                    { -2344, 603, "Тип інструменту", null, "type", 0 },
                    { -2343, 603, "Потужність", null, "power", 1 },
                    { -2342, 602, "Тип інструменту", null, "type", 0 },
                    { -2341, 602, "Потужність", null, "power", 1 },
                    { -2340, 601, "Тип інструменту", null, "type", 0 },
                    { -2339, 601, "Потужність", null, "power", 1 },
                    { -2338, 512, "Розмір", null, "size", 0 },
                    { -2337, 512, "Колір", null, "color", 0 },
                    { -2336, 512, "Матеріал", null, "material", 0 },
                    { -2335, 511, "Розмір", null, "size", 0 },
                    { -2334, 511, "Колір", null, "color", 0 },
                    { -2333, 511, "Матеріал", null, "material", 0 },
                    { -2332, 510, "Розмір", null, "size", 0 },
                    { -2331, 510, "Колір", null, "color", 0 },
                    { -2330, 510, "Матеріал", null, "material", 0 },
                    { -2329, 509, "Розмір", null, "size", 0 },
                    { -2328, 509, "Колір", null, "color", 0 },
                    { -2327, 509, "Матеріал", null, "material", 0 },
                    { -2326, 508, "Розмір", null, "size", 0 },
                    { -2325, 508, "Колір", null, "color", 0 },
                    { -2324, 508, "Матеріал", null, "material", 0 },
                    { -2323, 507, "Розмір", null, "size", 0 },
                    { -2322, 507, "Колір", null, "color", 0 },
                    { -2321, 507, "Матеріал", null, "material", 0 },
                    { -2320, 506, "Розмір", null, "size", 0 },
                    { -2319, 506, "Колір", null, "color", 0 },
                    { -2318, 506, "Матеріал", null, "material", 0 },
                    { -2317, 505, "Розмір", null, "size", 0 },
                    { -2316, 505, "Колір", null, "color", 0 },
                    { -2315, 505, "Матеріал", null, "material", 0 },
                    { -2314, 504, "Розмір", null, "size", 0 },
                    { -2313, 504, "Колір", null, "color", 0 },
                    { -2312, 504, "Матеріал", null, "material", 0 },
                    { -2311, 503, "Розмір", null, "size", 0 },
                    { -2310, 503, "Колір", null, "color", 0 },
                    { -2309, 503, "Матеріал", null, "material", 0 },
                    { -2308, 502, "Розмір", null, "size", 0 },
                    { -2307, 502, "Колір", null, "color", 0 },
                    { -2306, 502, "Матеріал", null, "material", 0 },
                    { -2305, 501, "Розмір", null, "size", 0 },
                    { -2304, 501, "Колір", null, "color", 0 },
                    { -2303, 501, "Матеріал", null, "material", 0 },
                    { -2302, 416, "Тип", null, "type", 0 },
                    { -2301, 416, "Колір", null, "color", 0 },
                    { -2300, 416, "Клас енергоспоживання", null, "energy_class", 0 },
                    { -2299, 415, "Тип", null, "type", 0 },
                    { -2298, 415, "Колір", null, "color", 0 },
                    { -2297, 415, "Клас енергоспоживання", null, "energy_class", 0 },
                    { -2296, 414, "Тип", null, "type", 0 },
                    { -2295, 414, "Колір", null, "color", 0 },
                    { -2294, 414, "Клас енергоспоживання", null, "energy_class", 0 },
                    { -2293, 413, "Тип", null, "type", 0 },
                    { -2292, 413, "Колір", null, "color", 0 },
                    { -2291, 413, "Клас енергоспоживання", null, "energy_class", 0 },
                    { -2290, 412, "Тип", null, "type", 0 },
                    { -2289, 412, "Колір", null, "color", 0 },
                    { -2288, 412, "Клас енергоспоживання", null, "energy_class", 0 },
                    { -2287, 411, "Тип", null, "type", 0 },
                    { -2286, 411, "Колір", null, "color", 0 },
                    { -2285, 411, "Клас енергоспоживання", null, "energy_class", 0 },
                    { -2284, 410, "Тип", null, "type", 0 },
                    { -2283, 410, "Колір", null, "color", 0 },
                    { -2282, 410, "Клас енергоспоживання", null, "energy_class", 0 },
                    { -2281, 409, "Тип", null, "type", 0 },
                    { -2280, 409, "Колір", null, "color", 0 },
                    { -2279, 409, "Клас енергоспоживання", null, "energy_class", 0 },
                    { -2278, 408, "Тип", null, "type", 0 },
                    { -2277, 408, "Колір", null, "color", 0 },
                    { -2276, 408, "Клас енергоспоживання", null, "energy_class", 0 },
                    { -2275, 407, "Тип", null, "type", 0 },
                    { -2274, 407, "Колір", null, "color", 0 },
                    { -2273, 407, "Клас енергоспоживання", null, "energy_class", 0 },
                    { -2272, 406, "Тип", null, "type", 0 },
                    { -2271, 406, "Колір", null, "color", 0 },
                    { -2270, 406, "Клас енергоспоживання", null, "energy_class", 0 },
                    { -2269, 405, "Тип", null, "type", 0 },
                    { -2268, 405, "Колір", null, "color", 0 },
                    { -2267, 405, "Клас енергоспоживання", null, "energy_class", 0 },
                    { -2266, 404, "Тип", null, "type", 0 },
                    { -2265, 404, "Колір", null, "color", 0 },
                    { -2264, 404, "Клас енергоспоживання", null, "energy_class", 0 },
                    { -2263, 403, "Тип", null, "type", 0 },
                    { -2262, 403, "Колір", null, "color", 0 },
                    { -2261, 403, "Клас енергоспоживання", null, "energy_class", 0 },
                    { -2260, 402, "Тип", null, "type", 0 },
                    { -2259, 402, "Колір", null, "color", 0 },
                    { -2258, 402, "Клас енергоспоживання", null, "energy_class", 0 },
                    { -2257, 401, "Тип", null, "type", 0 },
                    { -2256, 401, "Колір", null, "color", 0 },
                    { -2255, 401, "Клас енергоспоживання", null, "energy_class", 0 },
                    { -2254, 315, "Жанр", null, "genre", 0 },
                    { -2253, 315, "Платформа", null, "platform", 0 },
                    { -2252, 314, "Жанр", null, "genre", 0 },
                    { -2251, 314, "Платформа", null, "platform", 0 },
                    { -2250, 313, "Жанр", null, "genre", 0 },
                    { -2249, 313, "Платформа", null, "platform", 0 },
                    { -2248, 312, "Жанр", null, "genre", 0 },
                    { -2247, 312, "Платформа", null, "platform", 0 },
                    { -2246, 311, "Жанр", null, "genre", 0 },
                    { -2245, 311, "Платформа", null, "platform", 0 },
                    { -2244, 310, "Жанр", null, "genre", 0 },
                    { -2243, 310, "Платформа", null, "platform", 0 },
                    { -2242, 309, "Жанр", null, "genre", 0 },
                    { -2241, 309, "Платформа", null, "platform", 0 },
                    { -2240, 308, "Жанр", null, "genre", 0 },
                    { -2239, 308, "Платформа", null, "platform", 0 },
                    { -2238, 307, "Жанр", null, "genre", 0 },
                    { -2237, 307, "Платформа", null, "platform", 0 },
                    { -2236, 306, "Жанр", null, "genre", 0 },
                    { -2235, 306, "Платформа", null, "platform", 0 },
                    { -2234, 305, "Жанр", null, "genre", 0 },
                    { -2233, 305, "Платформа", null, "platform", 0 },
                    { -2232, 304, "Жанр", null, "genre", 0 },
                    { -2231, 304, "Платформа", null, "platform", 0 },
                    { -2230, 303, "Жанр", null, "genre", 0 },
                    { -2229, 303, "Платформа", null, "platform", 0 },
                    { -2228, 302, "Жанр", null, "genre", 0 },
                    { -2227, 302, "Платформа", null, "platform", 0 },
                    { -2226, 301, "Жанр", null, "genre", 0 },
                    { -2225, 301, "Платформа", null, "platform", 0 },
                    { -2224, 221, "Вбудована пам'ять", null, "memory", 1 },
                    { -2223, 221, "Колір", null, "color", 0 },
                    { -2222, 221, "Діагональ екрану", null, "screen_size", 1 },
                    { -2221, 220, "Вбудована пам'ять", null, "memory", 1 },
                    { -2220, 220, "Колір", null, "color", 0 },
                    { -2219, 220, "Діагональ екрану", null, "screen_size", 1 },
                    { -2218, 219, "Вбудована пам'ять", null, "memory", 1 },
                    { -2217, 219, "Колір", null, "color", 0 },
                    { -2216, 219, "Діагональ екрану", null, "screen_size", 1 },
                    { -2215, 218, "Вбудована пам'ять", null, "memory", 1 },
                    { -2214, 218, "Колір", null, "color", 0 },
                    { -2213, 218, "Діагональ екрану", null, "screen_size", 1 },
                    { -2212, 217, "Вбудована пам'ять", null, "memory", 1 },
                    { -2211, 217, "Колір", null, "color", 0 },
                    { -2210, 217, "Діагональ екрану", null, "screen_size", 1 },
                    { -2209, 216, "Вбудована пам'ять", null, "memory", 1 },
                    { -2208, 216, "Колір", null, "color", 0 },
                    { -2207, 216, "Діагональ екрану", null, "screen_size", 1 },
                    { -2206, 215, "Вбудована пам'ять", null, "memory", 1 },
                    { -2205, 215, "Колір", null, "color", 0 },
                    { -2204, 215, "Діагональ екрану", null, "screen_size", 1 },
                    { -2203, 214, "Вбудована пам'ять", null, "memory", 1 },
                    { -2202, 214, "Колір", null, "color", 0 },
                    { -2201, 214, "Діагональ екрану", null, "screen_size", 1 },
                    { -2200, 213, "Вбудована пам'ять", null, "memory", 1 },
                    { -2199, 213, "Колір", null, "color", 0 },
                    { -2198, 213, "Діагональ екрану", null, "screen_size", 1 },
                    { -2197, 212, "Вбудована пам'ять", null, "memory", 1 },
                    { -2196, 212, "Колір", null, "color", 0 },
                    { -2195, 212, "Діагональ екрану", null, "screen_size", 1 },
                    { -2194, 211, "Вбудована пам'ять", null, "memory", 1 },
                    { -2193, 211, "Колір", null, "color", 0 },
                    { -2192, 211, "Діагональ екрану", null, "screen_size", 1 },
                    { -2191, 210, "Вбудована пам'ять", null, "memory", 1 },
                    { -2190, 210, "Колір", null, "color", 0 },
                    { -2189, 210, "Діагональ екрану", null, "screen_size", 1 },
                    { -2188, 209, "Вбудована пам'ять", null, "memory", 1 },
                    { -2187, 209, "Колір", null, "color", 0 },
                    { -2186, 209, "Діагональ екрану", null, "screen_size", 1 },
                    { -2185, 208, "Вбудована пам'ять", null, "memory", 1 },
                    { -2184, 208, "Колір", null, "color", 0 },
                    { -2183, 208, "Діагональ екрану", null, "screen_size", 1 },
                    { -2182, 207, "Вбудована пам'ять", null, "memory", 1 },
                    { -2181, 207, "Колір", null, "color", 0 },
                    { -2180, 207, "Діагональ екрану", null, "screen_size", 1 },
                    { -2179, 206, "Вбудована пам'ять", null, "memory", 1 },
                    { -2178, 206, "Колір", null, "color", 0 },
                    { -2177, 206, "Діагональ екрану", null, "screen_size", 1 },
                    { -2176, 205, "Вбудована пам'ять", null, "memory", 1 },
                    { -2175, 205, "Колір", null, "color", 0 },
                    { -2174, 205, "Діагональ екрану", null, "screen_size", 1 },
                    { -2173, 204, "Вбудована пам'ять", null, "memory", 1 },
                    { -2172, 204, "Колір", null, "color", 0 },
                    { -2171, 204, "Діагональ екрану", null, "screen_size", 1 },
                    { -2170, 203, "Вбудована пам'ять", null, "memory", 1 },
                    { -2169, 203, "Колір", null, "color", 0 },
                    { -2168, 203, "Діагональ екрану", null, "screen_size", 1 },
                    { -2167, 202, "Вбудована пам'ять", null, "memory", 1 },
                    { -2166, 202, "Колір", null, "color", 0 },
                    { -2165, 202, "Діагональ екрану", null, "screen_size", 1 },
                    { -2164, 201, "Вбудована пам'ять", null, "memory", 1 },
                    { -2163, 201, "Колір", null, "color", 0 },
                    { -2162, 201, "Діагональ екрану", null, "screen_size", 1 },
                    { -2161, 129, "Тип відеокарти", null, "graphics", 0 },
                    { -2160, 129, "Об'єм накопичувача", null, "storage", 1 },
                    { -2159, 129, "Об'єм оперативної пам'яті", null, "ram", 1 },
                    { -2158, 129, "Тип процесора", null, "processor", 0 },
                    { -2157, 128, "Тип відеокарти", null, "graphics", 0 },
                    { -2156, 128, "Об'єм накопичувача", null, "storage", 1 },
                    { -2155, 128, "Об'єм оперативної пам'яті", null, "ram", 1 },
                    { -2154, 128, "Тип процесора", null, "processor", 0 },
                    { -2153, 127, "Тип відеокарти", null, "graphics", 0 },
                    { -2152, 127, "Об'єм накопичувача", null, "storage", 1 },
                    { -2151, 127, "Об'єм оперативної пам'яті", null, "ram", 1 },
                    { -2150, 127, "Тип процесора", null, "processor", 0 },
                    { -2149, 126, "Тип відеокарти", null, "graphics", 0 },
                    { -2148, 126, "Об'єм накопичувача", null, "storage", 1 },
                    { -2147, 126, "Об'єм оперативної пам'яті", null, "ram", 1 },
                    { -2146, 126, "Тип процесора", null, "processor", 0 },
                    { -2145, 125, "Тип відеокарти", null, "graphics", 0 },
                    { -2144, 125, "Об'єм накопичувача", null, "storage", 1 },
                    { -2143, 125, "Об'єм оперативної пам'яті", null, "ram", 1 },
                    { -2142, 125, "Тип процесора", null, "processor", 0 },
                    { -2141, 124, "Тип відеокарти", null, "graphics", 0 },
                    { -2140, 124, "Об'єм накопичувача", null, "storage", 1 },
                    { -2139, 124, "Об'єм оперативної пам'яті", null, "ram", 1 },
                    { -2138, 124, "Тип процесора", null, "processor", 0 },
                    { -2137, 123, "Тип відеокарти", null, "graphics", 0 },
                    { -2136, 123, "Об'єм накопичувача", null, "storage", 1 },
                    { -2135, 123, "Об'єм оперативної пам'яті", null, "ram", 1 },
                    { -2134, 123, "Тип процесора", null, "processor", 0 },
                    { -2133, 122, "Тип відеокарти", null, "graphics", 0 },
                    { -2132, 122, "Об'єм накопичувача", null, "storage", 1 },
                    { -2131, 122, "Об'єм оперативної пам'яті", null, "ram", 1 },
                    { -2130, 122, "Тип процесора", null, "processor", 0 },
                    { -2129, 121, "Тип відеокарти", null, "graphics", 0 },
                    { -2128, 121, "Об'єм накопичувача", null, "storage", 1 },
                    { -2127, 121, "Об'єм оперативної пам'яті", null, "ram", 1 },
                    { -2126, 121, "Тип процесора", null, "processor", 0 },
                    { -2125, 120, "Тип відеокарти", null, "graphics", 0 },
                    { -2124, 120, "Об'єм накопичувача", null, "storage", 1 },
                    { -2123, 120, "Об'єм оперативної пам'яті", null, "ram", 1 },
                    { -2122, 120, "Тип процесора", null, "processor", 0 },
                    { -2121, 119, "Тип відеокарти", null, "graphics", 0 },
                    { -2120, 119, "Об'єм накопичувача", null, "storage", 1 },
                    { -2119, 119, "Об'єм оперативної пам'яті", null, "ram", 1 },
                    { -2118, 119, "Тип процесора", null, "processor", 0 },
                    { -2117, 118, "Тип відеокарти", null, "graphics", 0 },
                    { -2116, 118, "Об'єм накопичувача", null, "storage", 1 },
                    { -2115, 118, "Об'єм оперативної пам'яті", null, "ram", 1 },
                    { -2114, 118, "Тип процесора", null, "processor", 0 },
                    { -2113, 117, "Тип відеокарти", null, "graphics", 0 },
                    { -2112, 117, "Об'єм накопичувача", null, "storage", 1 },
                    { -2111, 117, "Об'єм оперативної пам'яті", null, "ram", 1 },
                    { -2110, 117, "Тип процесора", null, "processor", 0 },
                    { -2109, 116, "Тип відеокарти", null, "graphics", 0 },
                    { -2108, 116, "Об'єм накопичувача", null, "storage", 1 },
                    { -2107, 116, "Об'єм оперативної пам'яті", null, "ram", 1 },
                    { -2106, 116, "Тип процесора", null, "processor", 0 },
                    { -2105, 115, "Тип відеокарти", null, "graphics", 0 },
                    { -2104, 115, "Об'єм накопичувача", null, "storage", 1 },
                    { -2103, 115, "Об'єм оперативної пам'яті", null, "ram", 1 },
                    { -2102, 115, "Тип процесора", null, "processor", 0 },
                    { -2101, 114, "Тип відеокарти", null, "graphics", 0 },
                    { -2100, 114, "Об'єм накопичувача", null, "storage", 1 },
                    { -2099, 114, "Об'єм оперативної пам'яті", null, "ram", 1 },
                    { -2098, 114, "Тип процесора", null, "processor", 0 },
                    { -2097, 113, "Тип відеокарти", null, "graphics", 0 },
                    { -2096, 113, "Об'єм накопичувача", null, "storage", 1 },
                    { -2095, 113, "Об'єм оперативної пам'яті", null, "ram", 1 },
                    { -2094, 113, "Тип процесора", null, "processor", 0 },
                    { -2093, 112, "Тип відеокарти", null, "graphics", 0 },
                    { -2092, 112, "Об'єм накопичувача", null, "storage", 1 },
                    { -2091, 112, "Об'єм оперативної пам'яті", null, "ram", 1 },
                    { -2090, 112, "Тип процесора", null, "processor", 0 },
                    { -2089, 111, "Тип відеокарти", null, "graphics", 0 },
                    { -2088, 111, "Об'єм накопичувача", null, "storage", 1 },
                    { -2087, 111, "Об'єм оперативної пам'яті", null, "ram", 1 },
                    { -2086, 111, "Тип процесора", null, "processor", 0 },
                    { -2085, 110, "Тип відеокарти", null, "graphics", 0 },
                    { -2084, 110, "Об'єм накопичувача", null, "storage", 1 },
                    { -2083, 110, "Об'єм оперативної пам'яті", null, "ram", 1 },
                    { -2082, 110, "Тип процесора", null, "processor", 0 },
                    { -2081, 109, "Тип відеокарти", null, "graphics", 0 },
                    { -2080, 109, "Об'єм накопичувача", null, "storage", 1 },
                    { -2079, 109, "Об'єм оперативної пам'яті", null, "ram", 1 },
                    { -2078, 109, "Тип процесора", null, "processor", 0 },
                    { -2077, 108, "Тип відеокарти", null, "graphics", 0 },
                    { -2076, 108, "Об'єм накопичувача", null, "storage", 1 },
                    { -2075, 108, "Об'єм оперативної пам'яті", null, "ram", 1 },
                    { -2074, 108, "Тип процесора", null, "processor", 0 },
                    { -2073, 107, "Тип відеокарти", null, "graphics", 0 },
                    { -2072, 107, "Об'єм накопичувача", null, "storage", 1 },
                    { -2071, 107, "Об'єм оперативної пам'яті", null, "ram", 1 },
                    { -2070, 107, "Тип процесора", null, "processor", 0 },
                    { -2069, 106, "Тип відеокарти", null, "graphics", 0 },
                    { -2068, 106, "Об'єм накопичувача", null, "storage", 1 },
                    { -2067, 106, "Об'єм оперативної пам'яті", null, "ram", 1 },
                    { -2066, 106, "Тип процесора", null, "processor", 0 },
                    { -2065, 105, "Тип відеокарти", null, "graphics", 0 },
                    { -2064, 105, "Об'єм накопичувача", null, "storage", 1 },
                    { -2063, 105, "Об'єм оперативної пам'яті", null, "ram", 1 },
                    { -2062, 105, "Тип процесора", null, "processor", 0 },
                    { -2061, 104, "Тип відеокарти", null, "graphics", 0 },
                    { -2060, 104, "Об'єм накопичувача", null, "storage", 1 },
                    { -2059, 104, "Об'єм оперативної пам'яті", null, "ram", 1 },
                    { -2058, 104, "Тип процесора", null, "processor", 0 },
                    { -2057, 103, "Тип відеокарти", null, "graphics", 0 },
                    { -2056, 103, "Об'єм накопичувача", null, "storage", 1 },
                    { -2055, 103, "Об'єм оперативної пам'яті", null, "ram", 1 },
                    { -2054, 103, "Тип процесора", null, "processor", 0 },
                    { -2053, 102, "Тип відеокарти", null, "graphics", 0 },
                    { -2052, 102, "Об'єм накопичувача", null, "storage", 1 },
                    { -2051, 102, "Об'єм оперативної пам'яті", null, "ram", 1 },
                    { -2050, 102, "Тип процесора", null, "processor", 0 },
                    { -2049, 101, "Тип відеокарти", null, "graphics", 0 },
                    { -2048, 101, "Об'єм накопичувача", null, "storage", 1 },
                    { -2047, 101, "Об'єм оперативної пам'яті", null, "ram", 1 },
                    { -2046, 101, "Тип процесора", null, "processor", 0 },
                    { -2045, 19, "Категорія товару", null, "category", 0 },
                    { -2044, 19, "Розмір знижки", null, "discount_size", 1 },
                    { -2043, 18, "Категорія товару", null, "category", 0 },
                    { -2042, 18, "Розмір знижки", null, "discount_size", 1 },
                    { -2041, 17, "Місткість", null, "capacity", 1 },
                    { -2040, 17, "Тип", null, "type", 0 },
                    { -2039, 16, "Тип обладнання", null, "equipment_type", 0 },
                    { -2038, 15, "Міцність", null, "strength", 1 },
                    { -2037, 15, "Об'єм", null, "volume", 1 },
                    { -2036, 15, "Тип", null, "type", 0 },
                    { -2035, 14, "Формат", null, "format", 0 },
                    { -2034, 14, "Тип", null, "type", 0 },
                    { -2033, 13, "Вік тварини", null, "animal_age", 0 },
                    { -2032, 13, "Вид товару", null, "product_type", 0 },
                    { -2031, 13, "Тип тварини", null, "animal_type", 0 },
                    { -2030, 12, "Тип", null, "type", 0 },
                    { -2029, 12, "Вік", null, "age", 1 },
                    { -2028, 11, "Для кого", null, "for_whom", 0 },
                    { -2027, 11, "Тип", null, "type", 0 },
                    { -2026, 10, "Стать", null, "gender", 0 },
                    { -2025, 10, "Матеріал", null, "material", 0 },
                    { -2024, 10, "Колір", null, "color", 0 },
                    { -2023, 10, "Розмір", null, "size", 0 },
                    { -2022, 9, "Розмір", null, "size", 0 },
                    { -2021, 9, "Вид спорту", null, "sport_type", 0 },
                    { -2020, 8, "Матеріал", null, "material", 0 },
                    { -2019, 8, "Тип", null, "type", 0 },
                    { -2018, 7, "Розмір", null, "size", 0 },
                    { -2017, 7, "Матеріал", null, "material", 0 },
                    { -2016, 6, "Тип інструменту", null, "type", 0 },
                    { -2015, 6, "Потужність", null, "power", 1 },
                    { -2014, 5, "Розмір", null, "size", 0 },
                    { -2013, 5, "Колір", null, "color", 0 },
                    { -2012, 5, "Матеріал", null, "material", 0 },
                    { -2011, 4, "Тип", null, "type", 0 },
                    { -2010, 4, "Колір", null, "color", 0 },
                    { -2009, 4, "Клас енергоспоживання", null, "energy_class", 0 },
                    { -2008, 3, "Жанр", null, "genre", 0 },
                    { -2007, 3, "Платформа", null, "platform", 0 },
                    { -2006, 2, "Вбудована пам'ять", null, "memory", 1 },
                    { -2005, 2, "Колір", null, "color", 0 },
                    { -2004, 2, "Діагональ екрану", null, "screen_size", 1 },
                    { -2003, 1, "Тип відеокарти", null, "graphics", 0 },
                    { -2002, 1, "Об'єм накопичувача", null, "storage", 1 },
                    { -2001, 1, "Об'єм оперативної пам'яті", null, "ram", 1 },
                    { -2000, 1, "Тип процесора", null, "processor", 0 }
                });
        }

        /// <inheritdoc />
        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2596);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2595);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2594);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2593);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2592);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2591);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2590);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2589);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2588);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2587);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2586);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2585);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2584);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2583);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2582);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2581);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2580);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2579);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2578);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2577);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2576);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2575);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2574);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2573);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2572);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2571);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2570);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2569);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2568);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2567);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2566);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2565);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2564);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2563);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2562);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2561);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2560);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2559);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2558);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2557);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2556);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2555);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2554);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2553);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2552);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2551);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2550);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2549);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2548);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2547);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2546);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2545);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2544);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2543);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2542);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2541);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2540);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2539);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2538);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2537);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2536);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2535);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2534);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2533);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2532);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2531);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2530);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2529);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2528);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2527);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2526);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2525);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2524);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2523);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2522);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2521);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2520);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2519);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2518);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2517);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2516);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2515);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2514);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2513);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2512);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2511);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2510);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2509);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2508);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2507);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2506);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2505);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2504);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2503);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2502);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2501);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2500);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2499);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2498);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2497);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2496);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2495);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2494);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2493);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2492);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2491);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2490);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2489);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2488);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2487);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2486);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2485);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2484);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2483);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2482);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2481);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2480);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2479);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2478);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2477);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2476);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2475);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2474);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2473);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2472);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2471);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2470);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2469);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2468);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2467);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2466);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2465);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2464);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2463);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2462);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2461);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2460);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2459);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2458);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2457);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2456);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2455);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2454);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2453);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2452);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2451);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2450);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2449);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2448);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2447);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2446);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2445);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2444);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2443);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2442);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2441);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2440);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2439);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2438);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2437);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2436);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2435);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2434);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2433);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2432);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2431);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2430);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2429);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2428);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2427);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2426);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2425);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2424);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2423);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2422);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2421);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2420);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2419);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2418);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2417);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2416);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2415);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2414);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2413);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2412);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2411);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2410);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2409);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2408);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2407);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2406);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2405);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2404);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2403);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2402);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2401);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2400);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2399);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2398);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2397);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2396);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2395);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2394);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2393);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2392);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2391);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2390);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2389);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2388);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2387);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2386);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2385);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2384);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2383);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2382);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2381);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2380);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2379);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2378);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2377);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2376);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2375);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2374);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2373);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2372);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2371);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2370);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2369);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2368);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2367);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2366);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2365);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2364);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2363);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2362);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2361);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2360);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2359);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2358);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2357);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2356);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2355);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2354);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2353);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2352);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2351);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2350);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2349);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2348);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2347);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2346);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2345);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2344);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2343);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2342);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2341);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2340);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2339);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2338);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2337);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2336);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2335);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2334);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2333);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2332);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2331);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2330);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2329);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2328);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2327);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2326);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2325);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2324);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2323);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2322);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2321);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2320);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2319);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2318);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2317);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2316);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2315);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2314);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2313);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2312);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2311);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2310);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2309);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2308);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2307);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2306);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2305);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2304);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2303);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2302);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2301);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2300);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2299);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2298);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2297);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2296);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2295);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2294);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2293);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2292);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2291);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2290);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2289);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2288);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2287);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2286);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2285);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2284);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2283);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2282);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2281);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2280);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2279);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2278);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2277);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2276);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2275);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2274);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2273);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2272);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2271);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2270);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2269);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2268);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2267);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2266);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2265);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2264);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2263);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2262);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2261);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2260);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2259);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2258);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2257);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2256);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2255);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2254);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2253);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2252);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2251);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2250);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2249);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2248);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2247);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2246);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2245);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2244);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2243);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2242);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2241);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2240);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2239);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2238);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2237);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2236);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2235);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2234);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2233);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2232);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2231);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2230);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2229);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2228);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2227);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2226);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2225);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2224);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2223);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2222);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2221);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2220);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2219);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2218);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2217);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2216);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2215);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2214);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2213);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2212);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2211);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2210);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2209);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2208);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2207);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2206);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2205);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2204);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2203);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2202);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2201);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2200);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2199);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2198);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2197);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2196);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2195);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2194);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2193);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2192);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2191);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2190);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2189);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2188);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2187);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2186);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2185);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2184);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2183);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2182);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2181);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2180);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2179);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2178);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2177);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2176);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2175);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2174);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2173);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2172);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2171);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2170);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2169);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2168);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2167);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2166);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2165);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2164);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2163);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2162);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2161);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2160);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2159);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2158);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2157);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2156);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2155);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2154);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2153);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2152);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2151);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2150);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2149);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2148);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2147);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2146);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2145);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2144);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2143);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2142);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2141);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2140);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2139);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2138);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2137);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2136);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2135);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2134);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2133);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2132);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2131);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2130);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2129);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2128);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2127);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2126);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2125);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2124);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2123);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2122);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2121);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2120);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2119);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2118);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2117);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2116);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2115);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2114);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2113);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2112);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2111);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2110);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2109);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2108);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2107);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2106);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2105);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2104);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2103);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2102);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2101);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2100);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2099);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2098);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2097);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2096);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2095);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2094);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2093);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2092);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2091);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2090);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2089);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2088);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2087);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2086);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2085);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2084);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2083);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2082);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2081);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2080);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2079);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2078);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2077);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2076);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2075);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2074);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2073);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2072);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2071);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2070);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2069);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2068);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2067);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2066);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2065);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2064);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2063);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2062);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2061);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2060);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2059);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2058);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2057);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2056);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2055);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2054);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2053);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2052);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2051);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2050);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2049);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2048);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2047);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2046);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2045);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2044);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2043);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2042);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2041);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2040);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2039);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2038);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2037);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2036);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2035);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2034);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2033);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2032);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2031);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2030);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2029);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2028);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2027);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2026);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2025);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2024);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2023);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2022);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2021);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2020);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2019);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2018);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2017);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2016);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2015);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2014);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2013);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2012);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2011);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2010);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2009);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2008);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2007);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2006);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2005);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2004);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2003);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2002);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2001);

            migrationBuilder.DeleteData(
                table: "CategoryFilters",
                keyColumn: "Id",
                keyValue: -2000);
        }
    }
}
